export type RunData = {
  date: string;
  運転速度: number;
  未検査率: number;
};

export const RunDataList: RunData[] = [
  {
    date: '10/01',
    運転速度: 15000,
    未検査率: 0.5,
  },
  {
    date: '10/02',
    運転速度: 14000,
    未検査率: 0.2,
  },
  {
    date: '10/03',
    運転速度: 14500,
    未検査率: 0.25,
  },
  {
    date: '10/04',
    運転速度: 13200,
    未検査率: 0.26,
  },
  {
    date: '10/05',
    運転速度: 13500,
    未検査率: 0.3,
  },
  {
    date: '10/06',
    運転速度: 13700,
    未検査率: 0.3,
  },
  {
    date: '10/07',
    運転速度: 14400,
    未検査率: 0.3,
  },
  {
    date: '10/08',
    運転速度: 14800,
    未検査率: 0.4,
  },
  {
    date: '10/09',
    運転速度: 15100,
    未検査率: 0.45,
  },
  {
    date: '10/10',
    運転速度: 15400,
    未検査率: 0.55,
  },
  {
    date: '10/11',
    運転速度: 15300,
    未検査率: 0.5,
  },
  {
    date: '10/12',
    運転速度: 15300,
    未検査率: 0.45,
  },
  {
    date: '10/13',
    運転速度: 15200,
    未検査率: 0.55,
  },
  {
    date: '10/14',
    運転速度: 15300,
    未検査率: 0.45,
  },
  {
    date: '10/15',
    運転速度: 15200,
    未検査率: 0.45,
  },
  {
    date: '10/16',
    運転速度: 15300,
    未検査率: 0.55,
  },
  {
    date: '10/17',
    運転速度: 15300,
    未検査率: 0.5,
  },
  {
    date: '10/18',
    運転速度: 15500,
    未検査率: 0.6,
  },
  {
    date: '10/19',
    運転速度: 14700,
    未検査率: 0.45,
  },
];